# SQL Connection Setup

In [2]:
%load_ext sql

In [3]:
%sql mysql+pymysql://root:Mysqlpw@localhost:3306/mavenfuzzyfactory

'Connected: root@mavenfuzzyfactory'

In [4]:
%%sql
USE mavenfuzzyfactory

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
0 rows affected.

[]

# Traffic Sources Analysis

## Top Traffic Sources

In [5]:
%%sql
SELECT 
    utm_source,
    utm_campaign,
    http_referer,
    COUNT(website_session_id) AS Sessions
FROM
    website_sessions
WHERE
    created_at < '2012-04-12'
GROUP BY 1 , 2 , 3
ORDER BY Sessions DESC

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
6 rows affected.

[('gsearch', 'nonbrand', 'https://www.gsearch.com', 3613),
 (None, None, None, 28),
 (None, None, 'https://www.gsearch.com', 27),
 ('gsearch', 'brand', 'https://www.gsearch.com', 26),
 ('bsearch', 'brand', 'https://www.bsearch.com', 7),
 (None, None, 'https://www.bsearch.com', 7)]

## Traffic Source Convertion Rate

In [6]:
%%sql
SELECT 
    COUNT(DISTINCT ws.website_session_id) Sessions,
    COUNT(DISTINCT o.order_id) Orders,
    COUNT(DISTINCT o.order_id) / COUNT(DISTINCT ws.website_session_id) Session_to_Order_Conv_Rate
FROM
    website_sessions ws
        LEFT JOIN
    orders o USING (website_session_id)
WHERE
    ws.created_at < '2012-04-14'AND
    ws.utm_source = 'gsearch' AND
    ws.utm_campaign = 'nonbrand'

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
1 rows affected.

[(3895, 112, Decimal('0.0288'))]

## Bid Optimization & Trend Analysis

In [7]:
%%sql
SELECT 
    MIN(DATE(ws.created_at)) AS 'Week_Start_Date',
    COUNT(DISTINCT ws.website_session_id) AS Sessions
FROM
    website_sessions ws
WHERE
    ws.created_at < '2012-05-10' AND
    ws.utm_source = 'gsearch' AND
    ws.utm_campaign = 'nonbrand'
GROUP BY 
    YEAR(ws.created_at),
    WEEK(ws.created_at)

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
8 rows affected.

[(datetime.date(2012, 3, 19), 896),
 (datetime.date(2012, 3, 25), 956),
 (datetime.date(2012, 4, 1), 1152),
 (datetime.date(2012, 4, 8), 983),
 (datetime.date(2012, 4, 15), 621),
 (datetime.date(2012, 4, 22), 594),
 (datetime.date(2012, 4, 29), 681),
 (datetime.date(2012, 5, 6), 399)]

##  Bid Optimization for Paid Traffic

In [8]:
%%sql
SELECT 
    ws.device_type Device,
    COUNT(DISTINCT ws.website_session_id) Sessions,
    COUNT(DISTINCT o.order_id) Orders,
    COUNT(DISTINCT o.order_id) / COUNT(DISTINCT ws.website_session_id) Session_to_Order_Conv_Rate
FROM
    website_sessions ws
        LEFT JOIN
            orders o
            USING (website_session_id)
WHERE
    ws.created_at < '2012-05-11' AND
    ws.utm_source = 'gsearch' AND
    ws.utm_campaign = 'nonbrand'
GROUP BY
    ws.device_type

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('desktop', 3911, 146, Decimal('0.0373')),
 ('mobile', 2492, 24, Decimal('0.0096'))]

## Trending w/ Granular Segments

In [9]:
%%sql
SELECT 
    MIN(DATE(ws.created_at)) AS Week_Start_At,
    SUM(CASE
        WHEN ws.device_type = 'desktop' THEN 1
            ELSE NULL
        END) AS Desktop_Sessions,
    SUM(CASE
        WHEN ws.device_type = 'mobile' THEN 1
            ELSE NULL
            END) AS Mobile_Sessions
FROM
    website_sessions ws
WHERE
    ws.created_at BETWEEN  '2012-04-15' AND '2012-06-09' AND
    ws.utm_source = 'gsearch' AND
    ws.utm_campaign = 'nonbrand' 
GROUP BY
    YEAR(ws.created_at), WEEK(ws.created_at)

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
8 rows affected.

[(datetime.date(2012, 4, 15), Decimal('383'), Decimal('238')),
 (datetime.date(2012, 4, 22), Decimal('360'), Decimal('234')),
 (datetime.date(2012, 4, 29), Decimal('425'), Decimal('256')),
 (datetime.date(2012, 5, 6), Decimal('430'), Decimal('282')),
 (datetime.date(2012, 5, 13), Decimal('403'), Decimal('214')),
 (datetime.date(2012, 5, 20), Decimal('661'), Decimal('190')),
 (datetime.date(2012, 5, 27), Decimal('585'), Decimal('183')),
 (datetime.date(2012, 6, 3), Decimal('582'), Decimal('157'))]

# Web Site Perfomance Analysis

## Finding Top Website Pages

In [10]:
%%sql
SELECT
    pageview_url,
    COUNT(pageview_url) AS Page_Hits
FROM
    website_pageviews
WHERE
    created_at < '2012-06-09'
GROUP BY
    pageview_url

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
7 rows affected.

[('/home', 10403),
 ('/products', 4239),
 ('/the-original-mr-fuzzy', 3037),
 ('/cart', 1306),
 ('/shipping', 869),
 ('/billing', 716),
 ('/thank-you-for-your-order', 306)]

## Finding Top Entry Pages

In [11]:
%%sql
SELECT 
    wp.pageview_url, COUNT(DISTINCT fpage.website_session_id) AS sessions
FROM 
    (SELECT 
        website_session_id, MIN(website_pageview_id) AS fpageid
    FROM
        website_pageviews
    WHERE
        created_at < '2012-06-12'
    GROUP BY
        website_session_id) AS fpage
    LEFT JOIN
        website_pageviews wp 
        ON fpage.fpageid = wp.website_pageview_id
GROUP BY
    wp.pageview_url

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
1 rows affected.

[('/home', 10714)]

## Analyzing Bounce Rates & Landing Page Tests

In [12]:
%%sql
SELECT 
    COUNT(DISTINCT website_session_id) AS sessions,
    SUM(CASE
        WHEN gped.n_pages_visited > 1 THEN 1
        ELSE NULL
    END) AS not_bouced,
    SUM(CASE
        WHEN gped.n_pages_visited = 1 THEN 1
        ELSE NULL
    END) AS bounced,
    SUM(CASE
        WHEN gped.n_pages_visited = 1 THEN 1
        ELSE NULL
    END) / COUNT(DISTINCT website_session_id) AS bounce_percentage
FROM
    (SELECT 
        website_session_id,
            COUNT(website_pageview_id) n_pages_visited
    FROM
        website_pageviews
    WHERE
        created_at < '2012-06-14'
    GROUP BY website_session_id) AS gped

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
1 rows affected.

[(11048, Decimal('4510'), Decimal('6538'), Decimal('0.5918'))]

## Analyzing Landing Page Tests

In [13]:
%%sql
WITH bounced_table AS(
SELECT ws.website_session_id, wpv.pageview_url, CASE WHEN COUNT(wpv.website_pageview_id) = 1 THEN 1 ELSE NULL END as bounced
FROM website_sessions ws
LEFT JOIN website_pageviews wpv
USING (website_session_id)
WHERE
    ws.created_at BETWEEN (
        SELECT MIN(created_at)
        FROM website_pageviews
        WHERE pageview_url = '/lander-1') AND
        '2012-07-28' AND
    ws.utm_source = 'gsearch' AND
    ws.utm_campaign = 'nonbrand'
GROUP BY ws.website_session_id)

SELECT bounced_table.pageview_url, COUNT(bounced_table.website_session_id) total_sessions, SUM(bounced_table.bounced) as bounced_sessions, SUM(bounced_table.bounced) / COUNT(bounced_table.website_session_id) as bounce_rate
FROM bounced_table
GROUP BY bounced_table.pageview_url

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('/lander-1', 2316, Decimal('1233'), Decimal('0.5324')),
 ('/home', 2261, Decimal('1319'), Decimal('0.5834'))]

## Landing Page Trend Analysis

In [14]:
%%sql
WITH bounced_data AS(
SELECT WEEK(ws.created_at) 'week', ws.created_at, wpv.pageview_url, CASE WHEN wpv.pageview_url = '/home' THEN 1 ELSE NULL END AS home_sessions, CASE WHEN wpv.pageview_url = '/lander-1' THEN 1 ELSE NULL END AS lander_sessions, CASE WHEN COUNT(wpv.website_pageview_id) = 1 THEN 1 ELSE NULL END AS bounce
FROM website_sessions ws
LEFT JOIN website_pageviews wpv
USING (website_session_id)
WHERE
    ws.created_at BETWEEN '2012-06-01' AND '2012-08-31' AND
    ws.utm_campaign = 'nonbrand' AND
    ws.utm_source = 'gsearch'
GROUP BY ws.website_session_id)

SELECT 
    MIN(DATE(bounced_data.created_at)) AS week_start,
    SUM(bounced_data.bounce) / COUNT(bounced_data.created_at) AS overall_bounced_rate,
    SUM(bounced_data.home_sessions) AS home_sessions,
    SUM(bounced_data.lander_sessions) AS lander_sessions    
FROM
    bounced_data
GROUP BY bounced_data.week
ORDER BY week_start ASC

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
14 rows affected.

[(datetime.date(2012, 6, 1), Decimal('0.6057'), Decimal('175'), None),
 (datetime.date(2012, 6, 3), Decimal('0.5871'), Decimal('792'), None),
 (datetime.date(2012, 6, 10), Decimal('0.6160'), Decimal('875'), None),
 (datetime.date(2012, 6, 17), Decimal('0.5582'), Decimal('492'), Decimal('350')),
 (datetime.date(2012, 6, 24), Decimal('0.5828'), Decimal('369'), Decimal('386')),
 (datetime.date(2012, 7, 1), Decimal('0.5821'), Decimal('392'), Decimal('388')),
 (datetime.date(2012, 7, 8), Decimal('0.5668'), Decimal('390'), Decimal('411')),
 (datetime.date(2012, 7, 15), Decimal('0.5424'), Decimal('429'), Decimal('421')),
 (datetime.date(2012, 7, 22), Decimal('0.5138'), Decimal('402'), Decimal('394')),
 (datetime.date(2012, 7, 29), Decimal('0.4971'), Decimal('33'), Decimal('995')),
 (datetime.date(2012, 8, 5), Decimal('0.5382'), None, Decimal('1087')),
 (datetime.date(2012, 8, 12), Decimal('0.5140'), None, Decimal('998')),
 (datetime.date(2012, 8, 19), Decimal('0.5010'), None, Decimal('1012')),
 (datetime.date(2012, 8, 26), Decimal('0.5378'), None, Decimal('833'))]

## Building Conversion Funnels

### Temporary Table - Flags

In [15]:
%%sql
CREATE TEMPORARY TABLE count_clicked
SELECT
funnel_flags.website_session_id,
MAX(funnel_flags.lander) AS clicked_lander,
MAX(funnel_flags.products) AS clicked_products,
MAX(funnel_flags.mr_fuzzy) AS clicked_mr_fuzzy,
MAX(funnel_flags.cart) AS clicked_cart,
MAX(funnel_flags.shipping) AS clicked_shipping,
MAX(funnel_flags.billing) AS clicked_billing,
MAX(funnel_flags.thank_you) AS clicked_thank_you

FROM (SELECT ws.website_session_id,
CASE WHEN wpv.pageview_url = '/lander-1' THEN 1 ELSE NULL END AS lander,
CASE WHEN wpv.pageview_url = '/products' THEN 1 ELSE NULL END AS products,
CASE WHEN wpv.pageview_url = '/the-original-mr-fuzzy' THEN 1 ELSE NULL END AS mr_fuzzy,
CASE WHEN wpv.pageview_url = '/cart' THEN 1 ELSE NULL END AS cart,
CASE WHEN wpv.pageview_url = '/shipping' THEN 1 ELSE NULL END AS shipping,
CASE WHEN wpv.pageview_url = '/billing' THEN 1 ELSE NULL END AS billing,
CASE WHEN wpv.pageview_url = '/thank-you-for-your-order' THEN 1 ELSE NULL END AS thank_you

FROM website_sessions AS ws
LEFT JOIN website_pageviews AS wpv
USING (website_session_id)

WHERE ws.created_at BETWEEN '2012-08-05' AND '2012-09-05' AND
ws.utm_source = 'gsearch' AND
ws.utm_campaign = 'nonbrand') AS funnel_flags
GROUP BY funnel_flags.website_session_id;

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
4493 rows affected.

[]

**Amostra da tabela tempor√°ria**

In [16]:
%%sql
SELECT *
FROM count_clicked
LIMIT 10

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
10 rows affected.

[(18243, 1, None, None, None, None, None, None),
 (18244, 1, 1, 1, 1, 1, 1, None),
 (18245, 1, None, None, None, None, None, None),
 (18246, 1, 1, None, None, None, None, None),
 (18247, 1, 1, 1, None, None, None, None),
 (18249, 1, None, None, None, None, None, None),
 (18250, 1, None, None, None, None, None, None),
 (18251, 1, 1, 1, None, None, None, None),
 (18252, 1, 1, 1, 1, 1, 1, None),
 (18254, 1, None, None, None, None, None, None)]

### Click Count

In [17]:
%%sql
SELECT
COUNT(count_clicked.website_session_id) AS sessions,
SUM(count_clicked.clicked_lander) AS clicked_lander,
SUM(count_clicked.clicked_products) AS clicked_products,
SUM(count_clicked.clicked_mr_fuzzy) AS clicked_mr_fuzzy,
SUM(count_clicked.clicked_cart) AS clicked_cart,
SUM(count_clicked.clicked_shipping) AS clicked_shipping,
SUM(count_clicked.clicked_billing) AS clicked_billing,
SUM(count_clicked.clicked_thank_you) AS clicked_thank_you
FROM count_clicked;

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
1 rows affected.

[(4493, Decimal('4493'), Decimal('2115'), Decimal('1567'), Decimal('683'), Decimal('455'), Decimal('361'), Decimal('158'))]

### Click Rate

In [18]:
%%sql
SELECT
COUNT(count_clicked.website_session_id) AS sessions,
SUM(count_clicked.clicked_products) / SUM(count_clicked.clicked_lander) AS lander_click_rt,
SUM(count_clicked.clicked_mr_fuzzy) / SUM(count_clicked.clicked_products) AS products_click_rt,
SUM(count_clicked.clicked_cart) / SUM(count_clicked.clicked_mr_fuzzy) AS mr_fuzzy_click_rt,
SUM(count_clicked.clicked_shipping) / SUM(count_clicked.clicked_cart) AS cart_click_rt,
SUM(count_clicked.clicked_billing) / SUM(count_clicked.clicked_shipping) AS shipping_click_rt,
SUM(count_clicked.clicked_thank_you) / SUM(count_clicked.clicked_billing) AS billing_click_rt
FROM count_clicked;

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
1 rows affected.

[(4493, Decimal('0.4707'), Decimal('0.7409'), Decimal('0.4359'), Decimal('0.6662'), Decimal('0.7934'), Decimal('0.4377'))]

## Analyzing Conversion Funnel Tests

#### Using only visited pages table

In [19]:
%%sql
WITH ordered_status AS (
SELECT ws.website_session_id, wpv.pageview_url, CASE WHEN wpv.pageview_url = '/thank-you-for-your-order' THEN 1 ELSE NULL END AS ordered
FROM website_sessions AS ws
LEFT JOIN website_pageviews AS wpv
USING (website_session_id)

WHERE ws.created_at BETWEEN 
    (SELECT MIN(created_at)
    FROM website_pageviews
    WHERE pageview_url = '/billing-2'
    GROUP BY pageview_url) AND
    '2012-11-10'
),

ordered_sessions AS (
SELECT os.website_session_id, MAX(os.ordered) AS order_complete
FROM ordered_status AS os
GROUP BY os.website_session_id) 

SELECT ostatus.pageview_url, COUNT(DISTINCT ostatus.website_session_id) AS sessions, SUM(osessions.order_complete) AS orders, SUM(osessions.order_complete) / COUNT(DISTINCT ostatus.website_session_id) AS billing_to_order_rt
FROM ordered_status AS ostatus
INNER JOIN ordered_sessions AS osessions
USING(website_session_id)
GROUP BY ostatus.pageview_url
HAVING ostatus.pageview_url IN ('/billing','/billing-2')

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('/billing', 657, Decimal('300'), Decimal('0.4566')),
 ('/billing-2', 653, Decimal('409'), Decimal('0.6263'))]

#### Using orders table

In [20]:
%%sql
SELECT 
    wpv.pageview_url,
    COUNT(DISTINCT ws.website_session_id) AS sessions,
    COUNT(DISTINCT o.order_id) AS orders,
    COUNT(DISTINCT o.order_id) / COUNT(DISTINCT ws.website_session_id) AS billing_to_order_rt
FROM
    website_sessions AS ws
        LEFT JOIN
    website_pageviews AS wpv USING (website_session_id)
        LEFT JOIN
    orders AS o USING (website_session_id)
WHERE
    ws.created_at BETWEEN (SELECT 
            MIN(created_at)
        FROM
            website_pageviews
        WHERE
            pageview_url = '/billing-2'
        GROUP BY pageview_url) AND '2012-11-10'
        AND pageview_url IN ('/billing-2' , '/billing')
GROUP BY wpv.pageview_url

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('/billing', 657, 300, Decimal('0.4566')),
 ('/billing-2', 653, 409, Decimal('0.6263'))]

# Channel Portfolio Management Analysis

## Channel Portifolio Sessions

In [21]:
%%sql
WITH session_source AS (SELECT 
    ws.created_at,
    CASE WHEN ws.utm_source = 'gsearch' THEN 1 ELSE NULL END AS gsearch_hit,
    CASE WHEN ws.utm_source = 'bsearch' THEN 1 ELSE NULL END AS bsearch_hit
FROM
    website_sessions AS ws
WHERE
ws.created_at BETWEEN '2012-08-22' AND '2012-11-29' AND
ws.utm_campaign = 'nonbrand')
    
SELECT 
    MIN(ss.created_at) AS week_start,
    SUM(ss.gsearch_hit) AS gsearch_sessions,
    SUM(ss.bsearch_hit) AS bsearch_sessions
FROM
    session_source AS ss
GROUP BY WEEK(ss.created_at)
ORDER BY week_start ASC

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
15 rows affected.

[(datetime.datetime(2012, 8, 22, 0, 5, 44), Decimal('590'), Decimal('197')),
 (datetime.datetime(2012, 8, 26, 0, 30, 14), Decimal('1056'), Decimal('343')),
 (datetime.datetime(2012, 9, 2, 0, 0, 23), Decimal('925'), Decimal('290')),
 (datetime.datetime(2012, 9, 9, 0, 0, 12), Decimal('951'), Decimal('329')),
 (datetime.datetime(2012, 9, 16, 0, 22, 15), Decimal('1151'), Decimal('365')),
 (datetime.datetime(2012, 9, 23, 0, 5, 26), Decimal('1050'), Decimal('321')),
 (datetime.datetime(2012, 9, 30, 0, 20, 14), Decimal('999'), Decimal('316')),
 (datetime.datetime(2012, 10, 7, 0, 1, 27), Decimal('1002'), Decimal('330')),
 (datetime.datetime(2012, 10, 14, 0, 8, 49), Decimal('1257'), Decimal('420')),
 (datetime.datetime(2012, 10, 21, 0, 17, 35), Decimal('1302'), Decimal('431')),
 (datetime.datetime(2012, 10, 28, 0, 27, 2), Decimal('1211'), Decimal('384')),
 (datetime.datetime(2012, 11, 4, 0, 11, 19), Decimal('1350'), Decimal('429')),
 (datetime.datetime(2012, 11, 11, 0, 9, 6), Decimal('1246'), Decimal('438')),
 (datetime.datetime(2012, 11, 18, 0, 16, 54), Decimal('3508'), Decimal('1093')),
 (datetime.datetime(2012, 11, 25, 0, 27, 10), Decimal('2286'), Decimal('774'))]

## Channel Characteristics Comparison

In [22]:
%%sql
WITH session_source AS (SELECT 
    ws.utm_source,
    ws.device_type,
    ws.website_session_id,
    CASE WHEN ws.device_type = 'mobile' THEN 1 ELSE NULL END AS mobile_hit
FROM
    website_sessions AS ws
WHERE
ws.created_at BETWEEN '2012-08-22' AND '2012-11-30' AND
ws.utm_campaign = 'nonbrand')
    
SELECT 
    ss.utm_source,
    COUNT(ss.website_session_id) AS sessions,
    SUM(ss.mobile_hit) AS mobile_sessions,
    SUM(ss.mobile_hit)/COUNT(ss.website_session_id) AS mobile_percentage
FROM
    session_source AS ss
GROUP BY ss.utm_source
ORDER BY ss.utm_source ASC

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('bsearch', 6522, Decimal('562'), Decimal('0.0862')),
 ('gsearch', 20073, Decimal('4921'), Decimal('0.2452'))]

## Cross Channel Bid Optimization

In [23]:
%%sql
SELECT 
    ws.device_type,
    ws.utm_source,
    COUNT(DISTINCT ws.website_session_id) AS sessions,
    COUNT(DISTINCT o.order_id) AS orders,
    COUNT(DISTINCT o.order_id)/COUNT(DISTINCT ws.website_session_id) AS conversion_rt
FROM
    website_sessions AS ws
LEFT JOIN orders AS o
USING(website_session_id)
WHERE
ws.created_at BETWEEN '2012-08-22' AND '2012-09-19' AND
ws.utm_campaign = 'nonbrand'
GROUP BY ws.utm_source, ws.device_type
ORDER BY ws.device_type ASC

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
4 rows affected.

[('desktop', 'bsearch', 1162, 44, Decimal('0.0379')),
 ('desktop', 'gsearch', 3011, 136, Decimal('0.0452')),
 ('mobile', 'bsearch', 130, 1, Decimal('0.0077')),
 ('mobile', 'gsearch', 1015, 13, Decimal('0.0128'))]

## Channel Portfolio Trend Analysis

In [24]:
%%sql
WITH ss_source_device AS (SELECT 
    ws.created_at,
    CASE WHEN ws.utm_source = 'gsearch' AND ws.device_type = 'desktop' THEN 1 ELSE NULL END AS gsearch_desktop_ss,
    CASE WHEN ws.utm_source = 'bsearch' AND ws.device_type = 'desktop' THEN 1 ELSE NULL END AS bsearch_desktop_ss,
    CASE WHEN ws.utm_source = 'gsearch' AND ws.device_type = 'mobile' THEN 1 ELSE NULL END AS gsearch_mobile_ss,
    CASE WHEN ws.utm_source = 'bsearch' AND ws.device_type = 'mobile' THEN 1 ELSE NULL END AS bsearch_mobile_ss    
FROM
    website_sessions AS ws

WHERE
    ws.created_at BETWEEN '2012-11-04' AND '2012-12-22' AND
    ws.utm_campaign = 'nonbrand')

SELECT
    MIN(ss.created_at) AS week_start,
    SUM(ss.gsearch_desktop_ss) AS gsearch_desktop,
    SUM(ss.bsearch_desktop_ss) AS bsearch_desktop,
    SUM(ss.bsearch_desktop_ss) / SUM(ss.gsearch_desktop_ss) AS bsearch_pctg_gsearch_desktop,
    SUM(ss.gsearch_mobile_ss) AS gsearch_mobile,
    SUM(ss.bsearch_mobile_ss) AS bsearch_mobile,
    SUM(ss.bsearch_mobile_ss) / SUM(ss.gsearch_mobile_ss) AS bsearch_pctg_gsearch_mobile

FROM ss_source_device AS ss
GROUP BY WEEK(ss.created_at)

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
7 rows affected.

[(datetime.datetime(2012, 11, 4, 0, 11, 19), Decimal('1027'), Decimal('400'), Decimal('0.3895'), Decimal('323'), Decimal('29'), Decimal('0.0898')),
 (datetime.datetime(2012, 11, 11, 0, 9, 6), Decimal('956'), Decimal('401'), Decimal('0.4195'), Decimal('290'), Decimal('37'), Decimal('0.1276')),
 (datetime.datetime(2012, 11, 18, 0, 16, 54), Decimal('2655'), Decimal('1008'), Decimal('0.3797'), Decimal('853'), Decimal('85'), Decimal('0.0996')),
 (datetime.datetime(2012, 11, 25, 0, 27, 10), Decimal('2058'), Decimal('843'), Decimal('0.4096'), Decimal('692'), Decimal('62'), Decimal('0.0896')),
 (datetime.datetime(2012, 12, 2, 1, 11, 55), Decimal('1326'), Decimal('517'), Decimal('0.3899'), Decimal('396'), Decimal('31'), Decimal('0.0783')),
 (datetime.datetime(2012, 12, 9, 0, 10, 37), Decimal('1277'), Decimal('293'), Decimal('0.2294'), Decimal('424'), Decimal('46'), Decimal('0.1085')),
 (datetime.datetime(2012, 12, 16, 0, 11, 29), Decimal('1270'), Decimal('348'), Decimal('0.2740'), Decimal('376'), Decimal('41'), Decimal('0.1090'))]

## Direct Traffic Analysis

In [25]:
%%sql
WITH session_type AS (SELECT 
    ws.created_at,
    CASE WHEN ws.utm_campaign = 'nonbrand' THEN 1 ELSE NULL END AS nonbrand,
    CASE WHEN ws.utm_campaign = 'brand' THEN 1 ELSE NULL END AS brand,
    CASE WHEN ws.utm_campaign IS NULL AND ws.http_referer IS NULL THEN 1 ELSE NULL END AS direct,
    CASE WHEN ws.utm_campaign IS NULL AND ws.http_referer IS NOT NULL THEN 1 ELSE NULL END AS organic
FROM website_sessions AS ws
WHERE ws.created_at < '2012-12-23')

SELECT
    CONCAT(MONTH(st.created_at), '-', RIGHT(YEAR(st.created_at),2)) AS 'MM-YY',
    SUM(st.nonbrand) AS nonbrand,
    SUM(st.brand) AS brand,
    SUM(st.brand) / SUM(st.nonbrand) AS brand_pctg_nonbrand,
    SUM(st.direct) AS direct,
    SUM(st.direct) / SUM(st.nonbrand) AS direct_pctg_nonbrand,
    SUM(st.organic) AS organic,
    SUM(st.organic) / SUM(st.nonbrand) AS organic_pctg_nonbrand
    
FROM session_type AS st
GROUP BY YEAR(st.created_at),MONTH(st.created_at)

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
10 rows affected.

[('3-12', Decimal('1852'), Decimal('10'), Decimal('0.0054'), Decimal('9'), Decimal('0.0049'), Decimal('8'), Decimal('0.0043')),
 ('4-12', Decimal('3509'), Decimal('76'), Decimal('0.0217'), Decimal('71'), Decimal('0.0202'), Decimal('78'), Decimal('0.0222')),
 ('5-12', Decimal('3295'), Decimal('140'), Decimal('0.0425'), Decimal('151'), Decimal('0.0458'), Decimal('150'), Decimal('0.0455')),
 ('6-12', Decimal('3439'), Decimal('164'), Decimal('0.0477'), Decimal('170'), Decimal('0.0494'), Decimal('190'), Decimal('0.0552')),
 ('7-12', Decimal('3660'), Decimal('195'), Decimal('0.0533'), Decimal('187'), Decimal('0.0511'), Decimal('207'), Decimal('0.0566')),
 ('8-12', Decimal('5318'), Decimal('264'), Decimal('0.0496'), Decimal('250'), Decimal('0.0470'), Decimal('265'), Decimal('0.0498')),
 ('9-12', Decimal('5591'), Decimal('339'), Decimal('0.0606'), Decimal('285'), Decimal('0.0510'), Decimal('331'), Decimal('0.0592')),
 ('10-12', Decimal('6883'), Decimal('432'), Decimal('0.0628'), Decimal('440'), Decimal('0.0639'), Decimal('428'), Decimal('0.0622')),
 ('11-12', Decimal('12260'), Decimal('556'), Decimal('0.0454'), Decimal('571'), Decimal('0.0466'), Decimal('624'), Decimal('0.0509')),
 ('12-12', Decimal('6643'), Decimal('464'), Decimal('0.0698'), Decimal('482'), Decimal('0.0726'), Decimal('492'), Decimal('0.0741'))]

# Business Patterns and Seasonality Analysis

## Seasonality Analysis

### Slice by Month

In [26]:
%%sql
SELECT 
    YEAR(ws.created_at) AS year, 
    MONTH(ws.created_at) AS month,
    COUNT(DISTINCT ws.website_session_id) AS sessions,
    COUNT(DISTINCT o.order_id) AS orders

FROM website_sessions AS ws
LEFT JOIN orders AS o
USING(website_session_id)

WHERE YEAR(ws.created_at) = 2012

GROUP BY YEAR(ws.created_at), MONTH(ws.created_at)

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
10 rows affected.

[(2012, 3, 1879, 60),
 (2012, 4, 3734, 99),
 (2012, 5, 3736, 108),
 (2012, 6, 3963, 140),
 (2012, 7, 4249, 169),
 (2012, 8, 6097, 228),
 (2012, 9, 6546, 287),
 (2012, 10, 8183, 371),
 (2012, 11, 14011, 618),
 (2012, 12, 10072, 506)]

### Slice by Week

In [27]:
%%sql
SELECT 
    YEAR(ws.created_at) AS year, 
    MIN(DATE(ws.created_at)) AS week_start,
    COUNT(DISTINCT ws.website_session_id) AS sessions,
    COUNT(DISTINCT o.order_id) AS orders

FROM website_sessions AS ws
LEFT JOIN orders AS o
USING(website_session_id)

WHERE YEAR(ws.created_at) = 2012

GROUP BY YEAR(ws.created_at), WEEK(ws.created_at)

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
42 rows affected.

[(2012, datetime.date(2012, 3, 19), 896, 25),
 (2012, datetime.date(2012, 3, 25), 983, 35),
 (2012, datetime.date(2012, 4, 1), 1193, 29),
 (2012, datetime.date(2012, 4, 8), 1029, 28),
 (2012, datetime.date(2012, 4, 15), 679, 22),
 (2012, datetime.date(2012, 4, 22), 655, 18),
 (2012, datetime.date(2012, 4, 29), 770, 19),
 (2012, datetime.date(2012, 5, 6), 798, 17),
 (2012, datetime.date(2012, 5, 13), 706, 23),
 (2012, datetime.date(2012, 5, 20), 965, 28),
 (2012, datetime.date(2012, 5, 27), 875, 31),
 (2012, datetime.date(2012, 6, 3), 920, 34),
 (2012, datetime.date(2012, 6, 10), 994, 29),
 (2012, datetime.date(2012, 6, 17), 966, 37),
 (2012, datetime.date(2012, 6, 24), 883, 32),
 (2012, datetime.date(2012, 7, 1), 892, 30),
 (2012, datetime.date(2012, 7, 8), 925, 36),
 (2012, datetime.date(2012, 7, 15), 987, 47),
 (2012, datetime.date(2012, 7, 22), 954, 41),
 (2012, datetime.date(2012, 7, 29), 1172, 55),
 (2012, datetime.date(2012, 8, 5), 1235, 48),
 (2012, datetime.date(2012, 8, 12), 1181, 39),
 (2012, datetime.date(2012, 8, 19), 1522, 55),
 (2012, datetime.date(2012, 8, 26), 1593, 52),
 (2012, datetime.date(2012, 9, 2), 1418, 56),
 (2012, datetime.date(2012, 9, 9), 1488, 72),
 (2012, datetime.date(2012, 9, 16), 1776, 76),
 (2012, datetime.date(2012, 9, 23), 1624, 70),
 (2012, datetime.date(2012, 9, 30), 1553, 67),
 (2012, datetime.date(2012, 10, 7), 1632, 73),
 (2012, datetime.date(2012, 10, 14), 1955, 93),
 (2012, datetime.date(2012, 10, 21), 2042, 95),
 (2012, datetime.date(2012, 10, 28), 1923, 82),
 (2012, datetime.date(2012, 11, 4), 2086, 91),
 (2012, datetime.date(2012, 11, 11), 1973, 101),
 (2012, datetime.date(2012, 11, 18), 5130, 223),
 (2012, datetime.date(2012, 11, 25), 4172, 179),
 (2012, datetime.date(2012, 12, 2), 2727, 145),
 (2012, datetime.date(2012, 12, 9), 2489, 123),
 (2012, datetime.date(2012, 12, 16), 2718, 135),
 (2012, datetime.date(2012, 12, 23), 1682, 74),
 (2012, datetime.date(2012, 12, 30), 309, 21)]

## Business Patterns Analysis

In [28]:
%%sql
WITH b_pattern AS (
SELECT
    DATE(ws.created_at) AS created_at,
    WEEKDAY(ws.created_at) AS weekday,
    HOUR(ws.created_at) AS hour, 
    COUNT(DISTINCT ws.website_session_id) AS sessions
    
FROM website_sessions AS ws

WHERE ws.created_at BETWEEN '2012-09-15' AND '2012-11-15'

GROUP BY
    DATE(ws.created_at), 
    WEEKDAY(ws.created_at),
    HOUR(ws.created_at)
)
    
SELECT 
    bp.hour,
    ROUND(AVG(CASE WHEN WEEKDAY(bp.created_at) = 0 THEN bp.sessions ELSE NULL END),1) AS 'Monday',
    ROUND(AVG(CASE WHEN WEEKDAY(bp.created_at) = 1 THEN bp.sessions ELSE NULL END),1) AS 'Tuesday',
    ROUND(AVG(CASE WHEN WEEKDAY(bp.created_at) = 2 THEN bp.sessions ELSE NULL END),1) AS 'Wednesday',
    ROUND(AVG(CASE WHEN WEEKDAY(bp.created_at) = 3 THEN bp.sessions ELSE NULL END),1) AS 'Thursday',
    ROUND(AVG(CASE WHEN WEEKDAY(bp.created_at) = 4 THEN bp.sessions ELSE NULL END),1) AS 'Friday',
    ROUND(AVG(CASE WHEN WEEKDAY(bp.created_at) = 5 THEN bp.sessions ELSE NULL END),1) AS 'Saturday',
    ROUND(AVG(CASE WHEN WEEKDAY(bp.created_at) = 6 THEN bp.sessions ELSE NULL END),1) AS 'Sunday'
    
FROM b_pattern AS bp

GROUP BY 
    bp.hour
ORDER BY bp.hour ASC

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
24 rows affected.

[(0, Decimal('8.7'), Decimal('7.7'), Decimal('6.3'), Decimal('7.4'), Decimal('6.8'), Decimal('5.0'), Decimal('5.0')),
 (1, Decimal('6.6'), Decimal('6.7'), Decimal('5.3'), Decimal('4.9'), Decimal('7.1'), Decimal('5.0'), Decimal('3.0')),
 (2, Decimal('6.1'), Decimal('4.4'), Decimal('4.4'), Decimal('6.1'), Decimal('4.6'), Decimal('3.7'), Decimal('3.0')),
 (3, Decimal('5.7'), Decimal('4.0'), Decimal('4.7'), Decimal('4.6'), Decimal('3.6'), Decimal('3.9'), Decimal('3.4')),
 (4, Decimal('5.9'), Decimal('6.3'), Decimal('6.0'), Decimal('4.0'), Decimal('6.1'), Decimal('2.8'), Decimal('2.4')),
 (5, Decimal('5.0'), Decimal('5.4'), Decimal('5.1'), Decimal('5.4'), Decimal('4.6'), Decimal('4.3'), Decimal('3.9')),
 (6, Decimal('5.4'), Decimal('5.6'), Decimal('4.8'), Decimal('6.0'), Decimal('6.8'), Decimal('4.0'), Decimal('2.6')),
 (7, Decimal('7.3'), Decimal('7.8'), Decimal('7.4'), Decimal('10.6'), Decimal('7.0'), Decimal('5.7'), Decimal('4.8')),
 (8, Decimal('12.3'), Decimal('12.2'), Decimal('13.0'), Decimal('16.5'), Decimal('10.5'), Decimal('4.3'), Decimal('4.1')),
 (9, Decimal('17.6'), Decimal('15.7'), Decimal('19.6'), Decimal('19.3'), Decimal('17.5'), Decimal('7.6'), Decimal('6.0')),
 (10, Decimal('18.4'), Decimal('17.7'), Decimal('21.0'), Decimal('18.4'), Decimal('19.0'), Decimal('8.3'), Decimal('6.3')),
 (11, Decimal('18.0'), Decimal('19.1'), Decimal('24.9'), Decimal('21.6'), Decimal('20.9'), Decimal('7.2'), Decimal('7.7')),
 (12, Decimal('21.1'), Decimal('23.3'), Decimal('22.8'), Decimal('24.1'), Decimal('19.0'), Decimal('8.6'), Decimal('6.1')),
 (13, Decimal('17.8'), Decimal('23.0'), Decimal('20.8'), Decimal('20.6'), Decimal('21.6'), Decimal('8.1'), Decimal('8.4')),
 (14, Decimal('17.9'), Decimal('21.6'), Decimal('22.3'), Decimal('18.5'), Decimal('19.5'), Decimal('8.7'), Decimal('6.7')),
 (15, Decimal('21.6'), Decimal('17.1'), Decimal('25.3'), Decimal('23.5'), Decimal('21.3'), Decimal('6.9'), Decimal('7.1')),
 (16, Decimal('21.1'), Decimal('23.7'), Decimal('23.7'), Decimal('19.6'), Decimal('20.9'), Decimal('7.6'), Decimal('6.6')),
 (17, Decimal('19.4'), Decimal('15.9'), Decimal('20.2'), Decimal('19.8'), Decimal('12.9'), Decimal('6.4'), Decimal('7.6')),
 (18, Decimal('12.7'), Decimal('15.0'), Decimal('14.8'), Decimal('15.3'), Decimal('10.9'), Decimal('5.3'), Decimal('6.8')),
 (19, Decimal('12.4'), Decimal('14.1'), Decimal('13.3'), Decimal('11.6'), Decimal('14.3'), Decimal('7.1'), Decimal('6.4')),
 (20, Decimal('12.1'), Decimal('12.4'), Decimal('14.2'), Decimal('10.6'), Decimal('10.3'), Decimal('5.7'), Decimal('8.4')),
 (21, Decimal('9.1'), Decimal('12.6'), Decimal('11.4'), Decimal('9.4'), Decimal('7.3'), Decimal('5.7'), Decimal('10.2')),
 (22, Decimal('9.1'), Decimal('10.0'), Decimal('9.8'), Decimal('12.1'), Decimal('6.0'), Decimal('5.7'), Decimal('10.2')),
 (23, Decimal('8.8'), Decimal('8.6'), Decimal('9.6'), Decimal('10.6'), Decimal('7.6'), Decimal('5.3'), Decimal('8.3'))]

# Product Analysis

## Product-Level Sales Analysis

In [29]:
%%sql
SELECT 
    YEAR(o.created_at) AS year,
    MONTH(o.created_at) AS month,
    COUNT(o.order_id) AS num_sales,
    SUM(o.price_usd) AS total_rev,
    SUM(o.price_usd - o.cogs_usd) AS total_profit    
FROM
    orders AS o
WHERE
    o.created_at < '2013-01-04'
GROUP BY 
    YEAR(o.created_at) , MONTH(o.created_at)

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
11 rows affected.

[(2012, 3, 60, Decimal('2999.40'), Decimal('1830.00')),
 (2012, 4, 99, Decimal('4949.01'), Decimal('3019.50')),
 (2012, 5, 108, Decimal('5398.92'), Decimal('3294.00')),
 (2012, 6, 140, Decimal('6998.60'), Decimal('4270.00')),
 (2012, 7, 169, Decimal('8448.31'), Decimal('5154.50')),
 (2012, 8, 228, Decimal('11397.72'), Decimal('6954.00')),
 (2012, 9, 287, Decimal('14347.13'), Decimal('8753.50')),
 (2012, 10, 371, Decimal('18546.29'), Decimal('11315.50')),
 (2012, 11, 618, Decimal('30893.82'), Decimal('18849.00')),
 (2012, 12, 506, Decimal('25294.94'), Decimal('15433.00')),
 (2013, 1, 42, Decimal('2099.58'), Decimal('1281.00'))]

## Product Launch Analysis

In [30]:
%%sql
SELECT 
    YEAR(ws.created_at) AS year,
    MONTH(ws.created_at) AS month,
    COUNT(DISTINCT ws.website_session_id) AS sessions,
    COUNT(DISTINCT o.order_id) AS orders,    
    COUNT(DISTINCT o.order_id) / COUNT(DISTINCT ws.website_session_id) AS conv_rate,
    SUM(o.price_usd) / COUNT(DISTINCT ws.website_session_id) AS rev_per_session,
    SUM(CASE WHEN o.primary_product_id = 1 THEN 1 ELSE 0 END) AS product_one_orders,
    SUM(CASE WHEN o.primary_product_id = 2 THEN 1 ELSE 0 END) AS product_two_orders
FROM
    website_sessions AS ws
LEFT JOIN
    orders AS o
    ON ws.website_session_id = o.website_session_id

WHERE ws.created_at BETWEEN '2012-04-01' AND '2013-04-05'

GROUP BY 
    YEAR(ws.created_at) , MONTH(ws.created_at)

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
13 rows affected.

[(2012, 4, 3734, 99, Decimal('0.0265'), Decimal('1.325391'), Decimal('99'), Decimal('0')),
 (2012, 5, 3736, 108, Decimal('0.0289'), Decimal('1.445107'), Decimal('108'), Decimal('0')),
 (2012, 6, 3963, 140, Decimal('0.0353'), Decimal('1.765985'), Decimal('140'), Decimal('0')),
 (2012, 7, 4249, 169, Decimal('0.0398'), Decimal('1.988305'), Decimal('169'), Decimal('0')),
 (2012, 8, 6097, 228, Decimal('0.0374'), Decimal('1.869398'), Decimal('228'), Decimal('0')),
 (2012, 9, 6546, 287, Decimal('0.0438'), Decimal('2.191740'), Decimal('287'), Decimal('0')),
 (2012, 10, 8183, 371, Decimal('0.0453'), Decimal('2.266441'), Decimal('371'), Decimal('0')),
 (2012, 11, 14011, 618, Decimal('0.0441'), Decimal('2.204969'), Decimal('618'), Decimal('0')),
 (2012, 12, 10072, 506, Decimal('0.0502'), Decimal('2.511412'), Decimal('506'), Decimal('0')),
 (2013, 1, 6401, 391, Decimal('0.0611'), Decimal('3.127025'), Decimal('344'), Decimal('47')),
 (2013, 2, 7168, 497, Decimal('0.0693'), Decimal('3.692108'), Decimal('335'), Decimal('162')),
 (2013, 3, 6264, 385, Decimal('0.0615'), Decimal('3.176269'), Decimal('320'), Decimal('65')),
 (2013, 4, 1209, 96, Decimal('0.0794'), Decimal('4.085227'), Decimal('82'), Decimal('14'))]

## Product-Level Website Pathing Analysis

In [31]:
%%sql
WITH products_dates AS (
SELECT
    CASE
        WHEN ws.created_at < '2013-01-06' THEN 'A. Pre_Product 2'
        ELSE 'B. Post_Product 2'
    END AS time_period,
    ws.website_session_id,
    wpv.website_pageview_id,
    wpv.pageview_url,
    LEAD(wpv.pageview_url) OVER(PARTITION BY ws.website_session_id) AS next_page

FROM website_sessions AS ws

LEFT JOIN website_pageviews AS wpv
USING(website_session_id)

WHERE
    ws.created_at BETWEEN '2012-10-06' AND '2013-04-06'
)

SELECT 
    pd.time_period,
    COUNT(DISTINCT pd.website_session_id) AS sessions,
    COUNT(pd.next_page) AS with_next_pg,
    COUNT(pd.next_page) / COUNT(DISTINCT pd.website_session_id) AS pctg_w_next_pg,
    SUM(CASE WHEN pd.next_page = '/the-original-mr-fuzzy' THEN 1 ELSE 0 END) AS to_mrfuzzy,
    SUM(CASE WHEN pd.next_page = '/the-original-mr-fuzzy' THEN 1 ELSE 0 END) / COUNT(DISTINCT pd.website_session_id) AS pctg_mrfuzzy,
    SUM(CASE WHEN pd.next_page = '/the-forever-love-bear' THEN 1 ELSE 0 END) AS to_lovebear,
    SUM(CASE WHEN pd.next_page = '/the-forever-love-bear' THEN 1 ELSE 0 END) / COUNT(DISTINCT pd.website_session_id) AS pctg_lovebear
FROM products_dates AS pd
WHERE pd.pageview_url = '/products'
GROUP BY pd.time_period

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('A. Pre_Product 2', 15695, 11346, Decimal('0.7229'), Decimal('11346'), Decimal('0.7229'), Decimal('0'), Decimal('0.0000')),
 ('B. Post_Product 2', 10709, 8200, Decimal('0.7657'), Decimal('6654'), Decimal('0.6213'), Decimal('1546'), Decimal('0.1444'))]

## Product-Level Conversion Funnel Analysis

### Temporary Table - Flags

In [32]:
%%sql
CREATE TEMPORARY TABLE product_seen_flags
SELECT 
        MAX(ps.product_seen) AS product_seen,
        MAX(ps.cart) AS clicked_cart,
        MAX(ps.shipping) AS clicked_shipping,
        MAX(ps.billing) AS clicked_billing,
        MAX(ps.thank_you) AS clicked_thank_you
FROM (
    SELECT 
    ws.website_session_id,
        wpv.pageview_url,
        CASE 
            WHEN wpv.pageview_url = '/the-original-mr-fuzzy' THEN 'mrfuzzy'
            WHEN wpv.pageview_url = '/the-forever-love-bear' THEN 'lovebear'
            ELSE NULL
        END AS product_seen,
        CASE WHEN wpv.pageview_url = '/cart' THEN 1 ELSE NULL END AS cart,
        CASE WHEN wpv.pageview_url = '/shipping' THEN 1 ELSE NULL END AS shipping,
        CASE WHEN wpv.pageview_url = '/billing-2' THEN 1 ELSE NULL END AS billing,
        CASE WHEN wpv.pageview_url = '/thank-you-for-your-order' THEN 1 ELSE NULL END AS thank_you

    FROM website_sessions AS ws

    LEFT JOIN website_pageviews AS wpv
    USING(website_session_id)

    WHERE ws.created_at BETWEEN '2013-01-06' AND '2013-04-10'
) AS ps

GROUP BY ps.website_session_id

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
21146 rows affected.

[]

### Click Count

In [33]:
%%sql
SELECT
    ps.product_seen,
    COUNT(ps.product_seen) AS sessions,
    COUNT(ps.clicked_cart) AS clicked_cart,
    COUNT(ps.clicked_shipping) AS clicked_shipping,
    COUNT(ps.clicked_billing) AS clicked_billing,
    COUNT(ps.clicked_thank_you) AS clicked_thank_you

FROM product_seen_flags AS ps

WHERE ps.product_seen IS NOT NULL

GROUP BY ps.product_seen

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('mrfuzzy', 6984, 3037, 2083, 1709, 1087),
 ('lovebear', 1599, 877, 603, 488, 301)]

### Click Rate

In [34]:
%%sql
SELECT
    ps.product_seen,
    COUNT(ps.clicked_cart) / COUNT(ps.product_seen) AS product_click_rt,
    COUNT(ps.clicked_shipping) / COUNT(ps.clicked_cart) AS cart_click_rt,
    COUNT(ps.clicked_billing) / COUNT(ps.clicked_shipping) AS shipping_click_rt,
    COUNT(ps.clicked_thank_you) / COUNT(ps.clicked_billing) AS billing_click_rt

FROM product_seen_flags AS ps

WHERE ps.product_seen IS NOT NULL

GROUP BY ps.product_seen

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('mrfuzzy', Decimal('0.4349'), Decimal('0.6859'), Decimal('0.8205'), Decimal('0.6360')),
 ('lovebear', Decimal('0.5485'), Decimal('0.6876'), Decimal('0.8093'), Decimal('0.6168'))]

## Cross-Selling Analysis

In [35]:
%%sql
SELECT 
    CASE
        WHEN DATE(wpv.created_at) BETWEEN '2013-08-25' AND '2013-09-24' THEN 'A. Pre_Cross_Sell'
        WHEN DATE(wpv.created_at) BETWEEN '2013-09-25' AND '2013-10-24' THEN 'B. Post_Cross_Sell'
    END AS time_period,
    COUNT(DISTINCT CASE WHEN wpv.pageview_url = '/cart' THEN wpv.website_session_id ELSE NULL END) AS cart_sessions,
    COUNT(DISTINCT CASE WHEN wpv.pageview_url = '/shipping' THEN wpv.website_session_id ELSE NULL END) / COUNT(DISTINCT CASE WHEN wpv.pageview_url = '/cart' THEN wpv.website_session_id ELSE NULL END) AS cart_ctr,
    COUNT(DISTINCT oi.order_item_id) / COUNT(DISTINCT o.order_id) AS products_per_order,
    SUM(CASE WHEN wpv.pageview_url = '/cart' AND oi.is_primary_item = 1 THEN o.price_usd ELSE NULL END) / COUNT(DISTINCT o.order_id) AS AOV,
    SUM(CASE WHEN wpv.pageview_url = '/cart' AND oi.is_primary_item = 1 THEN o.price_usd ELSE NULL END) / COUNT(DISTINCT CASE WHEN wpv.pageview_url = '/cart' THEN wpv.website_session_id ELSE NULL END) AS rev_per_cart_session
    
FROM website_pageviews AS wpv
       
LEFT JOIN orders AS o
USING(website_session_id)
        
LEFT JOIN order_items AS oi
USING(order_id)


WHERE
    DATE(wpv.created_at) BETWEEN '2013-08-25' AND '2013-10-24'
    
GROUP BY time_period;

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('A. Pre_Cross_Sell', 1830, Decimal('0.6716'), Decimal('1.0000'), Decimal('51.416380'), Decimal('18.318842')),
 ('B. Post_Cross_Sell', 1975, Decimal('0.6841'), Decimal('1.0447'), Decimal('54.251848'), Decimal('18.431894'))]

##  Product Portfolio Expansion Analysis

In [36]:
%%sql
SELECT 
    CASE WHEN ws.created_at < '2013-12-12' THEN 'A. Pre Birthday Bear' ELSE 'B. Post Birthday Bear' END AS time_period,
    COUNT(DISTINCT o.order_id) / COUNT(DISTINCT ws.website_session_id) AS conv_rate,
    AVG(o.price_usd) AS AVG_order_value,
    AVG(o.items_purchased) AS products_per_order,
    SUM(o.price_usd) / COUNT(DISTINCT ws.website_session_id) AS revenue_per_session

FROM website_sessions AS ws

LEFT JOIN orders AS o
USING(website_session_id)

WHERE ws.created_at BETWEEN '2013-11-12' AND '2014-01-12'

GROUP BY time_period

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('A. Pre Birthday Bear', Decimal('0.0608'), Decimal('54.226502'), Decimal('1.0464'), Decimal('3.298677')),
 ('B. Post Birthday Bear', Decimal('0.0702'), Decimal('56.931319'), Decimal('1.1234'), Decimal('3.998763'))]

## Product Refund Rate Analysis

In [37]:
%%sql
SELECT 
    YEAR(oi.created_at) AS year,
    MONTH(oi.created_at) AS month,
    SUM(CASE WHEN oi.product_id = 1 THEN 1 ELSE NULL END) AS p1_orders,
    SUM(CASE WHEN oi.product_id = 1 AND oir.order_item_refund_id IS NOT NULL THEN 1 ELSE NULL END) / SUM(CASE WHEN oi.product_id = 1 THEN 1 ELSE NULL END) AS p1_refund_rt,    
    SUM(CASE WHEN oi.product_id = 2 THEN 1 ELSE NULL END) AS p2_orders,
    SUM(CASE WHEN oi.product_id = 2 AND oir.order_item_refund_id IS NOT NULL THEN 1 ELSE NULL END) / SUM(CASE WHEN oi.product_id = 2 THEN 1 ELSE NULL END) AS p2_refund_rt,
    SUM(CASE WHEN oi.product_id = 3 THEN 1 ELSE NULL END) AS p3_orders,
    SUM(CASE WHEN oi.product_id = 3 AND oir.order_item_refund_id IS NOT NULL THEN 1 ELSE NULL END) / SUM(CASE WHEN oi.product_id = 3 THEN 1 ELSE NULL END) AS p3_refund_rt,
    SUM(CASE WHEN oi.product_id = 4 THEN 1 ELSE NULL END) AS p4_orders,
    SUM(CASE WHEN oi.product_id = 4 AND oir.order_item_refund_id IS NOT NULL THEN 1 ELSE NULL END) / SUM(CASE WHEN oi.product_id = 4 THEN 1 ELSE NULL END) AS p4_refund_rt
FROM order_items AS oi

LEFT JOIN order_item_refunds AS oir
USING (order_item_id)

GROUP BY 
YEAR(created_at), MONTH(created_at)

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
37 rows affected.

[(2012, 3, Decimal('60'), Decimal('0.0167'), None, None, None, None, None, None),
 (2012, 4, Decimal('99'), Decimal('0.0505'), None, None, None, None, None, None),
 (2012, 5, Decimal('108'), Decimal('0.0370'), None, None, None, None, None, None),
 (2012, 6, Decimal('140'), Decimal('0.0571'), None, None, None, None, None, None),
 (2012, 7, Decimal('169'), Decimal('0.0828'), None, None, None, None, None, None),
 (2012, 8, Decimal('228'), Decimal('0.0746'), None, None, None, None, None, None),
 (2012, 9, Decimal('287'), Decimal('0.0906'), None, None, None, None, None, None),
 (2012, 10, Decimal('371'), Decimal('0.0728'), None, None, None, None, None, None),
 (2012, 11, Decimal('618'), Decimal('0.0744'), None, None, None, None, None, None),
 (2012, 12, Decimal('506'), Decimal('0.0593'), None, None, None, None, None, None),
 (2013, 1, Decimal('343'), Decimal('0.0496'), Decimal('47'), Decimal('0.0213'), None, None, None, None),
 (2013, 2, Decimal('336'), Decimal('0.0714'), Decimal('162'), Decimal('0.0123'), None, None, None, None),
 (2013, 3, Decimal('320'), Decimal('0.0563'), Decimal('65'), Decimal('0.0462'), None, None, None, None),
 (2013, 4, Decimal('459'), Decimal('0.0414'), Decimal('94'), Decimal('0.0106'), None, None, None, None),
 (2013, 5, Decimal('489'), Decimal('0.0634'), Decimal('82'), Decimal('0.0244'), None, None, None, None),
 (2013, 6, Decimal('503'), Decimal('0.0775'), Decimal('90'), Decimal('0.0556'), None, None, None, None),
 (2013, 7, Decimal('509'), Decimal('0.0727'), Decimal('95'), Decimal('0.0316'), None, None, None, None),
 (2013, 8, Decimal('510'), Decimal('0.0549'), Decimal('98'), Decimal('0.0102'), None, None, None, None),
 (2013, 9, Decimal('537'), Decimal('0.0428'), Decimal('98'), Decimal('0.0102'), None, None, None, None),
 (2013, 10, Decimal('603'), Decimal('0.0282'), Decimal('135'), Decimal('0.0148'), None, None, None, None),
 (2013, 11, Decimal('724'), Decimal('0.0345'), Decimal('174'), Decimal('0.0230'), None, None, None, None),
 (2013, 12, Decimal('818'), Decimal('0.0232'), Decimal('183'), Decimal('0.0219'), Decimal('139'), Decimal('0.0719'), None, None),
 (2014, 1, Decimal('728'), Decimal('0.0426'), Decimal('183'), Decimal('0.0219'), Decimal('200'), Decimal('0.0650'), None, None),
 (2014, 2, Decimal('584'), Decimal('0.0394'), Decimal('351'), Decimal('0.0171'), Decimal('211'), Decimal('0.0664'), Decimal('202'), Decimal('0.0099')),
 (2014, 3, Decimal('785'), Decimal('0.0306'), Decimal('193'), Decimal('0.0155'), Decimal('244'), Decimal('0.0697'), Decimal('205'), Decimal('0.0049')),
 (2014, 4, Decimal('917'), Decimal('0.0349'), Decimal('214'), Decimal('0.0187'), Decimal('267'), Decimal('0.0674'), Decimal('259'), Decimal('0.0154')),
 (2014, 5, Decimal('1030'), Decimal('0.0291'), Decimal('246'), Decimal('0.0163'), Decimal('299'), Decimal('0.0569'), Decimal('298'), Decimal('0.0067')),
 (2014, 6, Decimal('893'), Decimal('0.0571'), Decimal('245'), Decimal('0.0367'), Decimal('288'), Decimal('0.0556'), Decimal('249'), Decimal('0.0241')),
 (2014, 7, Decimal('961'), Decimal('0.0437'), Decimal('244'), Decimal('0.0369'), Decimal('276'), Decimal('0.0399'), Decimal('264'), Decimal('0.0152')),
 (2014, 8, Decimal('958'), Decimal('0.1378'), Decimal('237'), Decimal('0.0169'), Decimal('294'), Decimal('0.0680'), Decimal('303'), Decimal('0.0066')),
 (2014, 9, Decimal('1056'), Decimal('0.1326'), Decimal('251'), Decimal('0.0319'), Decimal('317'), Decimal('0.0662'), Decimal('327'), Decimal('0.0122')),
 (2014, 10, Decimal('1173'), Decimal('0.0247'), Decimal('284'), Decimal('0.0176'), Decimal('368'), Decimal('0.0462'), Decimal('377'), Decimal('0.0212')),
 (2014, 11, Decimal('1451'), Decimal('0.0345'), Decimal('377'), Decimal('0.0212'), Decimal('425'), Decimal('0.0541'), Decimal('449'), Decimal('0.0134')),
 (2014, 12, Decimal('1584'), Decimal('0.0372'), Decimal('387'), Decimal('0.0233'), Decimal('539'), Decimal('0.0649'), Decimal('588'), Decimal('0.0136')),
 (2015, 1, Decimal('1392'), Decimal('0.0374'), Decimal('394'), Decimal('0.0254'), Decimal('450'), Decimal('0.0667'), Decimal('610'), Decimal('0.0115')),
 (2015, 2, Decimal('1113'), Decimal('0.0350'), Decimal('644'), Decimal('0.0171'), Decimal('405'), Decimal('0.0494'), Decimal('544'), Decimal('0.0147')),
 (2015, 3, Decimal('864'), Decimal('0.0324'), Decimal('223'), Decimal('0.0269'), Decimal('263'), Decimal('0.0722'), Decimal('343'), Decimal('0.0058'))]

# User Analysis

## Identifying Repeat Visitors

In [38]:
%%sql
SELECT
    u.number_of_sessions -1 AS repeat_sessions,
    COUNT(DISTINCT u.user_id) AS users

FROM 
(SELECT 
    ws.user_id,
    ws.is_repeat_session,
    COUNT(ws.website_session_id) OVER(PARTITION BY ws.user_id) AS number_of_sessions
FROM website_sessions AS ws
WHERE ws.created_at BETWEEN '2014-01-01' AND '2014-11-01'
) AS u

WHERE u.is_repeat_session = 0

GROUP BY u.number_of_sessions

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
4 rows affected.

[(0, 126813), (1, 14086), (2, 315), (3, 4686)]

##  Time to Repeat Analysis

In [39]:
%%sql
--
SELECT
    AVG(u.date_diff) AS AVG_days_first_to_second,
    MIN(u.date_diff) AS MIN_days_first_to_second,
    MAX(u.date_diff) AS MAX_days_first_to_second
 
FROM 
(SELECT
    ws.user_id,
    DATEDIFF(LEAD(ws.created_at) OVER(PARTITION BY ws.user_id), ws.created_at) AS date_diff,
    ws.is_repeat_session
FROM website_sessions AS ws
WHERE ws.created_at BETWEEN '2014-01-01' AND '2014-11-03'
) AS u
 
WHERE u.is_repeat_session = 0 AND
u.date_diff IS NOT NULL

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
1 rows affected.

[(Decimal('35.3925'), 1, 122)]

## Repeat Channel Behavior Analysis

In [40]:
%%sql
SELECT
CASE
    WHEN ss.utm_source IS NULL AND ss.http_referer IN ('https://www.gsearch.com', 'https://www.bsearch.com') THEN 'organic_search'
    WHEN ss.utm_campaign = 'nonbrand' THEN 'paid_nonbrand'
    WHEN ss.utm_campaign = 'brand' THEN 'paid_brand'
    WHEN ss.utm_source IS NULL AND ss.http_referer IS NULL THEN 'direct-type-in'
    WHEN ss.utm_source = 'socialbook' THEN 'paid_social'
END AS channel_group,
SUM(ss.new_session) AS new_session,
SUM(ss.repeat_session) AS repeat_session


FROM
(SELECT 
    ws.utm_source,
    ws.utm_campaign,
    ws.http_referer,
    SUM(CASE WHEN ws.is_repeat_session = 0 THEN 1 ELSE 0 END) AS new_session,
    SUM(CASE WHEN ws.is_repeat_session = 1 THEN 1 ELSE 0 END) AS repeat_session
    
FROM website_sessions AS ws

WHERE
    created_at < '2014-11-05' AND
    ws.website_session_id NOT IN (SELECT website_session_id FROM website_sessions WHERE created_at < '2014-01-01')

GROUP BY 
    ws.utm_source,
    ws.utm_campaign,
    ws.http_referer
) AS ss
    
GROUP BY channel_group

ORDER BY new_session DESC

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
5 rows affected.

[('paid_nonbrand', Decimal('119950'), Decimal('0')),
 ('paid_social', Decimal('7652'), Decimal('0')),
 ('organic_search', Decimal('7139'), Decimal('11507')),
 ('direct-type-in', Decimal('6591'), Decimal('10564')),
 ('paid_brand', Decimal('6432'), Decimal('11027'))]

## New & Repeat Conversion Rates Analysis

In [41]:
%%sql
SELECT 
CASE WHEN ws.is_repeat_session = 1 THEN 'Repeat Session' ELSE 'New Session' END AS session_type,
COUNT(DISTINCT ws.website_session_id) AS sessions,
COUNT(DISTINCT o.order_id) / COUNT(DISTINCT ws.website_session_id) AS conv_rate,
SUM(o.price_usd) / COUNT(DISTINCT ws.website_session_id) AS rev_per_session

    
FROM website_sessions AS ws

LEFT JOIN orders AS o
USING(website_session_id)

WHERE
    ws.created_at < '2014-11-08' AND
    ws.website_session_id NOT IN (SELECT website_session_id FROM website_sessions WHERE created_at < '2014-01-01')

GROUP BY session_type

 * mysql+pymysql://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

[('New Session', 149787, Decimal('0.0680'), Decimal('4.343754')),
 ('Repeat Session', 33577, Decimal('0.0811'), Decimal('5.168828'))]